In [3]:
import mysql.connector
import pandas as pd

In [4]:
connection = mysql.connector.connect(host = "localhost",
                                    user = "root",
                                    password = "Anoop@160317")
print (connection)
connection.close()

<mysql.connector.connection_cext.CMySQLConnection object at 0x000002400E3D38B0>

In [28]:
connection = mysql.connector.connect(host = "localhost",
                                    user = "root",
                                    password = "Anoop@160317"
                                    )
cursorObject = connection.cursor()
cursorObject.execute("CREATE DATABASE e_commerce1")

In [5]:
connection = mysql.connector.connect(host = "localhost",
                                    user = "root",
                                    password = "Anoop@160317",
                                     database = "e_commerce1"
                                    )
cursorObject = connection.cursor()

In [30]:
suppliers ="""create table suppliers(SUPP_ID int primary key,SUUP_NAME varchar(50),SUPP_CITY varchar(50),SUPP_PHONE varchar(15))"""
cursorObject.execute(suppliers)

In [31]:
customer ="""create table customer(CUS_ID int not null,CUS_NAME varchar(20) null default null,CUS_PHONE varchar(10),
CUS_CITY varchar(30),CUS_GENDER char,primary key(CUS_ID))"""
cursorObject.execute(customer)

In [32]:
category="""create table category(CAT_ID int not null,CAT_NAME varchar(20) null default null,primary key(CAT_ID))"""
cursorObject.execute(category)

In [33]:
product = """create table product(PRO_ID int not null,PRO_NAME varchar(20) null default null,PRO_DESC varchar(60) null default null,CAT_ID int not null,primary key(PRO_ID),foreign key(CAT_ID) references category(CAT_ID))"""
cursorObject.execute(product)

In [34]:
product_details= """create table product_details(PROD_ID int not null,PRO_ID int not null,SUPP_ID int not null,PROD_PRICE int not null,primary key(PROD_ID),foreign key(PRO_ID) references product(PRO_ID),foreign key(SUPP_ID) references suppliers(SUPP_ID))"""
cursorObject.execute(product_details)

In [35]:
orders= """create table orders(ORD_ID int not null,ORD_AMOUNT int not null,ORD_DATE date,CUS_ID int not null,PROD_ID int not null, primary key(ORD_ID),foreign key(CUS_ID)references customer(CUS_ID), foreign key(PROD_ID) references product_details(PROD_ID))"""
cursorObject.execute(orders)

In [12]:
rating ="""create table rating(RAT_ID int not null,CUS_ID int not null,SUPP_ID int not null,RAT_RATSTARS int not null,primary key(RAT_ID), foreign key(SUPP_ID)references suppliers(SUPP_ID),foreign key(CUS_ID)references customer(CUS_ID))"""
cursorObject.execute(rating)

In [38]:
insert_query="insert into suppliers(SUPP_ID ,SUUP_NAME,SUPP_CITY ,SUPP_PHONE ) values (%s,%s,%s,%s)"
val =[(1,"Rajesh Retails","Delhi","1234567890"),
      (2,"Appario Ltd.","Mumbai","2589631470"),
      (3,"Knome products","Bangalore","9785462315"),
      (4,"Bansal Retails", "Kochi", "8975463285"),
      (5,"Mittal Ltd."," Lucknow","7898456532") ]
cursorObject.executemany(insert_query,val)
connection.commit()

In [6]:
insert_query="insert into customer(CUS_ID,CUS_NAME,CUS_PHONE,CUS_CITY,CUS_GENDER) values (%s,%s,%s,%s,%s)"
val = [(1,"AAKASH","9999999999","DELHI","M "),
        (2,"AMAN","9785463215","NOIDA","M"),
        (3,"NEHA","9999999998","MUMBAI","F"),
        (4,"MEGHA","9994562399","KOLKATA","F"),
        (5,"PULKIT","7895999999","LUCKNOW","M")]
cursorObject.executemany(insert_query,val)
connection.commit()

In [7]:
insert_query = "insert into category(CAT_ID,CAT_NAME) values (%s,%s)"
val= [(1,"BOOKS"),
      (2,"GAMES"),
      (3,"GROCERIES"),
      (4,"ELECTRONICS"),
      (5,"CLOTHES")]
cursorObject.executemany(insert_query,val)
connection.commit()

In [8]:
insert_query = "insert into product(PRO_ID,PRO_NAME,PRO_DESC,CAT_ID ) values (%s,%s,%s,%s)"
val = [(1,"GTA V","DFJDJFDJFDJFDJFJF",2),
        (2,"TSHIRT","DFDFJDFJDKFD",5), 
        (3,"ROG LAPTOP","DFNTTNTNTERND",4),
        (4,"OATS","REURENTBTOTH",3),
        (5,"HARRY POTTER","NBEMCTHTJTH",1)]
cursorObject.executemany(insert_query,val)
connection.commit()

In [9]:
insert_query = "insert into product_details(PROD_ID,PRO_ID,SUPP_ID,PROD_PRICE) values(%s,%s,%s,%s)"
val =[(1,1,2,1500),
        (2,3,5,30000),
        (3,5,1,3000),
        (4,2,3,2500 ),
        (5,4,1,1000)]
cursorObject.executemany(insert_query,val)
connection.commit()

In [11]:
insert_query = "insert into orders(ORD_ID,ORD_AMOUNT,ORD_DATE,CUS_ID,PROD_ID) values (%s,%s,%s,%s,%s)"
val = [(20,1500,"2021-10-12",3,5),
        (25,30500,"2021-09-16",5,2),
        (26,2000,"2021-10-05",1,1),
        (30,3500,"2021-08-16",4,3),
        (50,2000,"2021-10-06",2,1)]
cursorObject.executemany(insert_query,val)
connection.commit()

In [13]:
insert_query = "insert into rating(RAT_ID,CUS_ID,SUPP_ID,RAT_RATSTARS) values (%s,%s,%s,%s)"
val = [(1,2,2,4),
       (2,3,4,3),
       (3,5,1,5),
       (4,1,3,2),
       (5,4,5,4)]
cursorObject.executemany(insert_query,val)
connection.commit()

In [ ]:
### Q3) Display the number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000.

In [8]:
Query3 = """select customer.CUS_GENDER,count(customer.CUS_GENDER) as count from
            customer inner join `orders` on customer.CUS_ID=`orders`.CUS_ID 
            where `orders`.ORD_AMOUNT>=3000 group by customer.CUS_GENDER;"""
cursorObject.execute(Query3)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output,columns = ['CUS_GENDER','COUNT'])
output_df

  CUS_GENDER  COUNT
0          M      1
1          F      1

In [ ]:
### Q4) Display all the order along with product name ordered by a customer having Customer_Id=2;

In [12]:
Query4="""select `orders`.*,product.PRO_NAME from `orders`,product_details,product
        where `orders`.CUS_ID = 2 and `orders`.PROD_ID = product_details.PROD_ID
        and product_details.PRO_ID=product.PRO_ID"""
cursorObject.execute(Query4)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output,columns = ['ORD_ID','ORD_AMOUNT','ORD_DATE',
                                           'CUS_ID','PROD_ID','PRO_NAME'])
output_df

   ORD_ID  ORD_AMOUNT    ORD_DATE  CUS_ID  PROD_ID PRO_NAME
0      50        2000  2021-10-06       2        1    GTA V

In [ ]:
### Q5) Display the Supplier details who can supply more than one product.

In [17]:
Query5="""select suppliers.* from suppliers,product_details where suppliers.SUPP_ID
        in(select product_details.SUPP_ID from product_details group by product_details.SUPP_ID
        having count(product_details.SUPP_ID)>1) group by suppliers.SUPP_ID;"""
cursorObject.execute(Query5)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output,columns = ['SUPP_ID','SUUP_NAME','SUPP_CITY',
                                           'SUPP_PHONE'])
output_df

   SUPP_ID       SUUP_NAME SUPP_CITY  SUPP_PHONE
0        1  Rajesh Retails     Delhi  1234567890

In [ ]:
### Q6) Find the category of the product whose order amount is minimum.

In [16]:
Query6 = """select category.* from `orders` inner join product_details on
        `orders`.PROD_ID = product_details.PROD_ID inner join product on 
        product.PRO_ID = product_details.PRO_ID inner join category on 
        category.CAT_ID = product.CAT_ID having min(`orders`.ORD_AMOUNT); """
cursorObject.execute(Query6)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output,columns = ['CAT_ID','CAT_NAME'])
output_df

   CAT_ID   CAT_NAME
0       3  GROCERIES

In [ ]:
### Q7) Display the Id and Name of the Product ordered after “2021-10-05”.

In [19]:
Query7 = """select product.PRO_ID,product.PRO_NAME from `orders` inner join 
            product_details on product_details.PROD_ID=`orders`.PROD_ID 
            inner join product on product.PRO_ID=product_details.PRO_ID
            where `orders`.ORD_DATE>"2021-10-05";"""
cursorObject.execute(Query7)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output,columns = ['PRO_ID','PRO_NAME'])
output_df

   PRO_ID PRO_NAME
0       4     OATS
1       1    GTA V

In [ ]:
### Q8) Print the top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating.

In [8]:
Query8 ="""select suppliers.SUPP_ID,suppliers.SUUP_NAME,customer.CUS_NAME,
            rating.RAT_RATSTARS from rating inner join suppliers on 
            rating.SUPP_ID = suppliers.SUPP_ID inner join customer on 
            rating.CUS_ID = customer.CUS_ID order by 
            rating.RAT_RATSTARS desc limit 3"""
cursorObject.execute(Query8)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output,columns = ['SUPP_ID','SUPP_NAME','CUS_NAME',
                                           'RAT_RATSTARS'])
output_df

   SUPP_ID       SUPP_NAME CUS_NAME  RAT_RATSTARS
0        1  Rajesh Retails   PULKIT             5
1        2    Appario Ltd.     AMAN             4
2        5     Mittal Ltd.    MEGHA             4

In [ ]:
### Q9) Display customer name and gender whose names start or end with character 'A'.

In [13]:
Query9= """select customer.CUS_NAME,customer.CUS_GENDER from
            customer where customer.CUS_NAME like "A%" or customer.CUS_NAME like
            "%A";"""
cursorObject.execute(Query9)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output,columns = ['CUS_NAME','CUS_GENDER'])
output_df

  CUS_NAME CUS_GENDER
0   AAKASH          M
1     AMAN          M
2     NEHA          F
3    MEGHA          F

In [ ]:
### Q10) Display the total order amount of the male customers.

In [15]:
Query10 ="""select sum(`orders`.ORD_AMOUNT) as AMOUNT from `orders` inner
            join customer on `orders`.CUS_ID = customer.CUS_ID where
            customer.CUS_GENDER='M';"""
cursorObject.execute(Query10)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output,columns = ['AMOUNT'])
output_df

  AMOUNT
0  34500

In [ ]:
### Q11) Display all the Customers left outer join with  the orders

In [19]:
Query11 = """select * from customer left outer join `orders` on 
            customer.CUS_ID = `orders`.CUS_ID;"""
cursorObject.execute(Query11)
output = cursorObject.fetchall()

output_df = pd.DataFrame(output,columns = ['CUS_ID','CUS_NAME','CUS_PHONE',
                                           'CUS_CITY','CUS_GENDER','ORD_ID',
                                           'ORD_AMOUNT','ORD_DATE','CUS_ID','PROD_ID'])
output_df

,CUS_ID,CUS_NAME,CUS_PHONE,CUS_CITY,CUS_GENDER,ORD_ID,ORD_AMOUNT,ORD_DATE,CUS_ID,PROD_ID
0,1,AAKASH,9999999999,DELHI,M,26,2000,2021-10-05,1,1
1,2,AMAN,9785463215,NOIDA,M,50,2000,2021-10-06,2,1
2,3,NEHA,9999999998,MUMBAI,F,20,1500,2021-10-12,3,5
3,4,MEGHA,9994562399,KOLKATA,F,30,3500,2021-08-16,4,3
4,5,PULKIT,7895999999,LUCKNOW,M,25,30500,2021-09-16,5,2